performance/reports/runs/normal-day-2026-08-04T06-38-42/summary.txt
     ✓ login 200
     ✓ post detail 200
     ✓ post reaction 2xx
     ✓ unread count 200
     ✓ notif list 200
     ✓ read one 200
     ✓ chat rooms 200
     ✓ chat messages 200
     ✓ chat read 200
     ✓ board list 200
     ✓ hot daily 200
     ✓ post create 2xx
     ✓ post list 200
     ✓ comment list 200
     ✓ post search 200
     ✓ friend list 200
     ✓ received reqs 200
     ✓ logout 200
     ✓ scrap 2xx
     ✓ comment reaction 200
     ✓ comment create 2xx
     ✓ user info 200
     ✓ my posts 200
     ✓ meal today 200
     ✓ timetable today 200
     ✓ read all 200
     ✓ ws handshake 101
     ✓ post update 200
     ✓ post delete 200
     ✓ refresh 200
     ✓ meal month 200

     auth_token_refreshes...........: 4       0.007345/s
     chat_ws_errors.................: 48      0.088136/s
     chat_ws_messages_sent..........: 24      0.044068/s
   ✓ checks.........................: 100.00% ✓ 2924     ✗ 0   
     data_received..................: 26 MB   48 kB/s
     data_sent......................: 1.1 MB  2.0 kB/s
     http_req_blocked...............: avg=12.95µs  min=0s      med=0s      max=3.63ms   p(90)=0s       p(95)=0s       p(99)=519.2µs 
     http_req_connecting............: avg=7.66µs   min=0s      med=0s      max=2.04ms   p(90)=0s       p(95)=0s       p(99)=398.09µs
     http_req_duration..............: avg=34.29ms  min=2.99ms  med=10.96ms max=303.65ms p(90)=86.18ms  p(95)=101.2ms  p(99)=228.08ms
       { expected_response:true }...: avg=34.29ms  min=2.99ms  med=10.96ms max=303.65ms p(90)=86.18ms  p(95)=101.2ms  p(99)=228.08ms
     ✓ { feature:auth }.............: avg=81.48ms  min=16.38ms med=79.61ms max=137.78ms p(90)=93.24ms  p(95)=98.71ms  p(99)=116.27ms
     ✓ { feature:board }............: avg=4.72ms   min=3.21ms  med=4.39ms  max=13.61ms  p(90)=5.6ms    p(95)=6.83ms   p(99)=10.81ms 
     ✓ { feature:chat }.............: avg=8.37ms   min=4.27ms  med=7.18ms  max=28.11ms  p(90)=12.78ms  p(95)=15.42ms  p(99)=24.43ms 
     ✓ { feature:comment }..........: avg=79.3ms   min=3.52ms  med=34.38ms max=303.65ms p(90)=215.67ms p(95)=235.01ms p(99)=273ms   
     ✓ { feature:friend }...........: avg=5.57ms   min=3.53ms  med=4.97ms  max=13.33ms  p(90)=8.23ms   p(95)=9.56ms   p(99)=12.78ms 
     ✓ { feature:hot }..............: avg=15.33ms  min=9.32ms  med=13.77ms max=38.12ms  p(90)=21.22ms  p(95)=23.16ms  p(99)=33.77ms 
     ✓ { feature:mypage }...........: avg=7.22ms   min=3.02ms  med=5.09ms  max=32.57ms  p(90)=11.09ms  p(95)=14.61ms  p(99)=27.96ms 
     ✓ { feature:notification }.....: avg=8.01ms   min=2.99ms  med=5.3ms   max=64.68ms  p(90)=15.75ms  p(95)=23.96ms  p(99)=32.43ms 
     ✓ { feature:post }.............: avg=9.89ms   min=3.5ms   med=7.83ms  max=82.56ms  p(90)=16.32ms  p(95)=20.13ms  p(99)=34.93ms 
     ✓ { feature:reaction }.........: avg=26.97ms  min=17.99ms med=24.42ms max=48.04ms  p(90)=35.31ms  p(95)=42.35ms  p(99)=47.17ms 
     ✓ { feature:school }...........: avg=6.73ms   min=3.43ms  med=6.03ms  max=13.25ms  p(90)=10.45ms  p(95)=11.67ms  p(99)=12.93ms 
     ✓ { feature:scrap }............: avg=27.19ms  min=17.18ms med=28.3ms  max=36.16ms  p(90)=34.32ms  p(95)=35.22ms  p(99)=35.97ms 
     ✓ { feature:timetable }........: avg=6.95ms   min=4.6ms   med=5.48ms  max=18.12ms  p(90)=9.82ms   p(95)=13.3ms   p(99)=17.16ms 
     ✓ { op:read }..................: avg=22.83ms  min=2.99ms  med=8.08ms  max=303.65ms p(90)=33.21ms  p(95)=190ms    p(99)=235.13ms
     ✓ { op:write }.................: avg=66.48ms  min=3.64ms  med=76.51ms max=137.78ms p(90)=90.98ms  p(95)=95.79ms  p(99)=113.74ms
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 2900
     http_req_receiving.............: avg=145.71µs min=0s      med=0s      max=10.37ms  p(90)=546.42µs p(95)=797.48µs p(99)=2.06ms  
     http_req_sending...............: avg=16.99µs  min=0s      med=0s      max=1.02ms   p(90)=0s       p(95)=0s       p(99)=569.2µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=34.12ms  min=2.65ms  med=10.89ms max=301.67ms p(90)=86.13ms  p(95)=101.2ms  p(99)=226.4ms 
     http_reqs......................: 2900    5.324913/s
     iteration_duration.............: avg=8.87s    min=1.11s   med=6.77s   max=25.97s   p(90)=17.05s   p(95)=18.43s   p(99)=21.77s  
     iterations.....................: 559     1.026423/s
     vus............................: 1       min=0      max=15
     vus_max........................: 15      min=15     max=15
     ws_connecting..................: avg=6.44ms   min=4.03ms  med=4.91ms  max=36.4ms   p(90)=7.31ms   p(95)=8.7ms    p(99)=30.07ms 
     ws_msgs_received...............: 48      0.088136/s
     ws_msgs_sent...................: 72      0.132205/s
     ws_session_duration............: avg=3.87s    min=2.01s   med=3.87s   max=5.75s    p(90)=5.12s    p(95)=5.55s    p(99)=5.72s   
     ws_sessions....................: 24      0.044068/s